## Plan Result (543: prod_appgateway - TerraformPlanApply)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * module.appgateway.azurerm_application_gateway.ag[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw"
        name                              = "aks-fe-00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/vh-admin-web" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-admin-web" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/vh-video-web" -> null
          - ip_addresses = [
              - "10.144.15.250",
              - "10.144.31.250",
            ] -> null
          - name         = "vh-video-web" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/c100-application" -> null
          - name                                = "c100-application" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/c100-application" -> null
          - probe_name                          = "c100-application" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/court-tribunal-hearings" -> null
          - name                                = "court-tribunal-hearings" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/court-tribunal-hearings" -> null
          - probe_name                          = "court-tribunal-hearings" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/court-tribunal-hearings-b2c-sign-in" -> null
          - name                                = "court-tribunal-hearings-b2c-sign-in" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/court-tribunal-hearings-b2c-sign-in" -> null
          - probe_name                          = "court-tribunal-hearings-b2c-sign-in" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/court-tribunal-hearings-b2c-staff" -> null
          - name                                = "court-tribunal-hearings-b2c-staff" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/court-tribunal-hearings-b2c-staff" -> null
          - probe_name                          = "court-tribunal-hearings-b2c-staff" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/darts-portal" -> null
          - name                                = "darts-portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/darts-portal" -> null
          - probe_name                          = "darts-portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---certificatedbailiffs" -> null
          - name                                = "dts-legacy-apps---certificatedbailiffs" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/dts-legacy-apps---certificatedbailiffs" -> null
          - probe_name                          = "dts-legacy-apps---certificatedbailiffs" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---civilappeals-casetracker" -> null
          - name                                = "dts-legacy-apps---civilappeals-casetracker" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/dts-legacy-apps---civilappeals-casetracker" -> null
          - probe_name                          = "dts-legacy-apps---civilappeals-casetracker" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---courtfines" -> null
          - name                                = "dts-legacy-apps---courtfines" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/dts-legacy-apps---courtfines" -> null
          - probe_name                          = "dts-legacy-apps---courtfines" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---immigration-appeals-iacfees" -> null
          - name                                = "dts-legacy-apps---immigration-appeals-iacfees" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/dts-legacy-apps---immigration-appeals-iacfees" -> null
          - probe_name                          = "dts-legacy-apps---immigration-appeals-iacfees" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---redirect-service" -> null
          - name                                = "dts-legacy-apps---redirect-service" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/dts-legacy-apps---redirect-service" -> null
          - probe_name                          = "dts-legacy-apps---redirect-service" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/ejudiciary-home" -> null
          - name                                = "ejudiciary-home" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/ejudiciary-home" -> null
          - probe_name                          = "ejudiciary-home" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/ejudiciary-home-apex" -> null
          - name                                = "ejudiciary-home-apex" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/ejudiciary-home-apex" -> null
          - probe_name                          = "ejudiciary-home-apex" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/ejudiciary-home-www" -> null
          - name                                = "ejudiciary-home-www" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/ejudiciary-home-www" -> null
          - probe_name                          = "ejudiciary-home-www" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/juror-bureau" -> null
          - name                                = "juror-bureau" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/juror-bureau" -> null
          - probe_name                          = "juror-bureau" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/juror-public" -> null
          - name                                = "juror-public" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/juror-public" -> null
          - probe_name                          = "juror-public" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
            # (3 unchanged attributes hidden)
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/portal" -> null
          - name                                = "portal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/probes/portal" -> null
          - probe_name                          = "portal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/dts-legacy-apps---courtfines"
          + backend_address_pool_name  = "dts-legacy-apps---courtfines"
          + backend_http_settings_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---courtfines"
          + backend_http_settings_name = "dts-legacy-apps---courtfines"
          + http_listener_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/httpListeners/dts-legacy-apps---courtfines"
          + http_listener_name         = "dts-legacy-apps---courtfines"
          + id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/requestRoutingRules/dts-legacy-apps---courtfines"
          + name                       = "dts-legacy-apps---courtfines"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/dts-legacy-apps---immigration-appeals-iacfees"
          + backend_address_pool_name  = "dts-legacy-apps---immigration-appeals-iacfees"
          + backend_http_settings_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---immigration-appeals-iacfees"
          + backend_http_settings_name = "dts-legacy-apps---immigration-appeals-iacfees"
          + http_listener_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/httpListeners/dts-legacy-apps---immigration-appeals-iacfees"
          + http_listener_name         = "dts-legacy-apps---immigration-appeals-iacfees"
          + id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/requestRoutingRules/dts-legacy-apps---immigration-appeals-iacfees"
          + name                       = "dts-legacy-apps---immigration-appeals-iacfees"
          + priority                   = 40
          + rewrite_rule_set_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/dts-legacy-apps---redirect-service"
          + backend_address_pool_name  = "dts-legacy-apps---redirect-service"
          + backend_http_settings_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/dts-legacy-apps---redirect-service"
          + backend_http_settings_name = "dts-legacy-apps---redirect-service"
          + http_listener_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/httpListeners/dts-legacy-apps---redirect-service"
          + http_listener_name         = "dts-legacy-apps---redirect-service"
          + id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/requestRoutingRules/dts-legacy-apps---redirect-service"
          + name                       = "dts-legacy-apps---redirect-service"
          + priority                   = 50
          + rewrite_rule_set_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendAddressPools/jd-bureau"
          + backend_address_pool_name  = "jd-bureau"
          + backend_http_settings_id   = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/backendHttpSettingsCollection/jd-bureau"
          + backend_http_settings_name = "jd-bureau"
          + http_listener_id           = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/httpListeners/jd-bureau"
          + http_listener_name         = "jd-bureau"
          + id                         = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/requestRoutingRules/jd-bureau"
          + name                       = "jd-bureau"
          + priority                   = 60
          + rewrite_rule_set_id        = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/applicationGateways/aks-fe-00-prod-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "c100-application"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "c100-application"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "c100-application"
          + id                          = (known after apply)
          + name                        = "c100-application"
          + priority                    = 130
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "darts-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "darts-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "darts-portal"
          + id                          = (known after apply)
          + name                        = "darts-portal"
          + priority                    = 230
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "ejudiciary-home"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "ejudiciary-home"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "ejudiciary-home"
          + id                          = (known after apply)
          + name                        = "ejudiciary-home"
          + priority                    = 170
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "ejudiciary-home-apex"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "ejudiciary-home-apex"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "ejudiciary-home-apex"
          + id                          = (known after apply)
          + name                        = "ejudiciary-home-apex"
          + priority                    = 180
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "ejudiciary-home-www"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "ejudiciary-home-www"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "ejudiciary-home-www"
          + id                          = (known after apply)
          + name                        = "ejudiciary-home-www"
          + priority                    = 190
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-bureau"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-bureau"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-bureau"
          + id                          = (known after apply)
          + name                        = "juror-bureau"
          + priority                    = 160
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "juror-public"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "juror-public"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "juror-public"
          + id                          = (known after apply)
          + name                        = "juror-public"
          + priority                    = 150
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "portal"
          + id                          = (known after apply)
          + name                        = "portal"
          + priority                    = 140
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "pre-portal"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "pre-portal"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "pre-portal"
          + id                          = (known after apply)
          + name                        = "pre-portal"
          + priority                    = 110
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sds-api-mgmt"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sds-api-mgmt"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sds-api-mgmt"
          + id                          = (known after apply)
          + name                        = "sds-api-mgmt"
          + priority                    = 120
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sds-build"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sds-build"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sds-build"
          + id                          = (known after apply)
          + name                        = "sds-build"
          + priority                    = 220
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "sds-sandbox-build"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "sds-sandbox-build"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "sds-sandbox-build"
          + id                          = (known after apply)
          + name                        = "sds-sandbox-build"
          + priority                    = 200
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "static-sds-sandbox-build"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "static-sds-sandbox-build"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "static-sds-sandbox-build"
          + id                          = (known after apply)
          + name                        = "static-sds-sandbox-build"
          + priority                    = 210
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "toffee"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "toffee"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "toffee"
          + id                          = (known after apply)
          + name                        = "toffee"
          + priority                    = 100
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rewrite_rule_set_name       = "x_fwded_proto"
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (31 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label 543: prod_appgateway - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/sds-azure-platform/issues/947/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":947,"Program":"tfcmt","SHA1":"","Target":"543: prod_appgateway - TerraformPlanApply","Vars":{}} -->